gahealth_pers = 10
armore_pers = 5
silaPav = 5
sila_pers = 5
print("__________________________")
print("Вітаю у грі *Підземелля Троля*")
print("__________________________")
print("пишіть усі команди з маленької букви")
print("__________________________")
step = (input("Напишіть слово в дужка,без дужок, щоб оглянути вхід в печеру!- [озирнутись]:\n"))
if (step == "озирнутись"):
      print("Ви акуратно оглянули стару печеру і побачили захований шолом серед камнів. Ваша броня збільшилась:")
      print(armore_pers+20)
      stepslolom = (input("Куди далі? [прямо] [вийти]: \n"))

if stepslolom == "вийти":
      print("Вам вистачило шолому і ви вийшли з печери.")
      print("**Game Over**")

if stepslolom == "прямо":
      print("Ви зробили крок вперед і знайшли меч в руках старого скелета. Сила збільшилась:")
      print(sila_pers+20)
      stepslp = (input("Перед вами три шляхи, куди підете? [йти вперед] [йти вліво] [йти вправо] [йти назад]\n"))

if stepslp == "йти вперед":
      print("Ви зайшли в невеличкий тунель, почався дивний землетрус, неначе щось гігантське рухалось неподалік.")
      print("Старі опори печери не витримали і обвалились на вас.")
      print("Але шолом вас врятував.")
      print("Нажаль, вибратись самостійно ви не зможете ще довго....")
      print("**Game Over**")

if stepslp == "йти назад":
    print("Вам вистачило шолома з мечом і ви пішли на вихід з печери.")
    print("**Game Over**")

if stepslp == "йти вправо":
    print("Ви чуєте дивне тремтіння землі....")
    step6 = (input(" Куди? [до кінця коридору] [повернути за кут]:\n"))

if stepslp == "йти вліво":
        print("В печері було дуже темно, але за те ви добре чули дивні звуки...Це був Гігантський Павук! Він атакував вас!")
        print("Ви вдарили його мечем.")
        print("Павук помер, це був критичний удар. Здоров'я павука:")
        print(silaPav - sila_pers)
        print("На вас ні подряпини, шолом захистив вас.")
        lor = (input("Куди далі? [бігти назад] [відпочити]:\n"))

if step6 == "повернути за кут":
    print("Ви не встигли зробити і крок далі, як на вас напав величезний Троль")
    print("*критичні поранення*")
    print("Такі печери не для гуляння....")
    print("**Game Over**")

if step6 == "до кінця коридору":
    print(
        "Ви знали, що тут щось є! Кімната з морем дорогоцінних каменів показалась вам в кінці коридору. Беріть "
        "скільки можете і тікайте поки нові монстри вас не знайшли!")
    print("**WIN**")

if lor =="відпочити":
    print("Виявилось, павук був тут не один....Поки ви відпочивали - на вас напали. Сил відбиватись не було...")
    print("**Game Over**")

if lor =="Бігти назад":
    print("Ви на роздорожжі, куди далі?")
    if lor == "Бігти назад":
     steprun = (input(" [ліворуч] [йти тільки прямо] [на вихід]:\n"))

if steprun == "ліворуч":
    print(
        "Ви зайшли в невеличкий тунель, почався дивний землетрус, неначе щось гігантське рухалось неподалік.")
    print("Старі опори печери не витримали і обвалились на вас.")
    print("Це було критичним для вашого здоров'я, але шолом вас врятував.")
    print("На жаль, вибратись самостійно ви не зможете ще довго....")
    print("**Game Over**")

if steprun == "на вихід":
    print("Вам вистачило пригод і ви пішли на вихід з печери.")
    print("**Game Over**")

if steprun == "йти тільки прямо":
    print("Ви чуєте дивне тремтіння землі....")
    if steprun == "Йти тіки прямо":
     win = (input(" Куди далі? [додому] [далі] [глянути за кут]:\n"))

if win == "додому":
    print("Вам вистачило шолома з мечом і ви пішли на вихід з печери.")
    print("**Game Over**")

if win == "далі":
    print(
        "Ви знали, що тут щось є! Кімната з морем дорогоцінних каменів показалась вам в кінці коридору. Беріть "
        "скільки можете і тікайте поки нові монстри вас не знайшли!")
    print("**WIN**")

if win=="глянути за кут":
    print("Ви не встигли зробити і крок далі, як на вас напав величезний Троль")
    print("*критичні поранення*")
    print("Такі печери не для гуляння....")
    print("**Game Over**")





